In [1]:
import pandas as pd

In [3]:
a=pd.Series([30,29,49,43,12])
a

0    30
1    29
2    49
3    43
4    12
dtype: int64

In [4]:
type(a)

pandas.core.series.Series

In [6]:
a.dtype

dtype('int64')

In [11]:
a=pd.Series([12,34,21,45,11],index=['a','b','c','d','e'],dtype=float)
a

a    12.0
b    34.0
c    21.0
d    45.0
e    11.0
dtype: float64

In [14]:
a['b']

34.0

In [21]:
a=a.drop('a')

In [25]:
s=pd.Series([1,2,3])
a.append(s,ignore_index=True)

C:\Users\anubhaw.sharma\AppData\Local\Temp\ipykernel_14348\1297985302.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  a.append(s,ignore_index=True)

0    34.0
1    21.0
2    45.0
3    11.0
4     1.0
5     2.0
6     3.0
dtype: float64

In [24]:
# pd.concat(s,a)

In [26]:
#DataFrame #type #info #loc #iloc

In [27]:
d= {'Price':[100,200,300],'Model':['a','b','c'],'Items':[1,2,3]}
df = pd.DataFrame(d)
df

   Price Model  Items
0    100     a      1
1    200     b      2
2    300     c      3

In [28]:
df.dtypes

Price     int64
Model    object
Items     int64
dtype: object

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Price   3 non-null      int64
 1   Model   3 non-null      object
 2   Items   3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [30]:
df.iloc[0,1]

'a'

In [31]:
df.iloc[:,1]

0    a
1    b
2    c
Name: Model, dtype: object

In [32]:
df.iloc[:,[0,1]] # index based

   Price Model
0    100     a
1    200     b
2    300     c

In [33]:
df.loc[1,'Price'] # label based indexing

200

In [34]:
df.loc[:,['Price','Items']]

   Price  Items
0    100      1
1    200      2
2    300      3

## Reading a CSV file

In [37]:
import os
os.getcwd()

'C:\\Users\\anubhaw.sharma\\Documents\\Python Code'

In [40]:
df=pd.read_csv('C:\\Users\\anubhaw.sharma\\Downloads\\emp.csv')
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
0,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600.0,NaN,124.0,50.0
1,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600.0,NaN,124.0,50.0
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400.0,NaN,101.0,10.0
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000.0,NaN,100.0,20.0
4,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0

In [41]:
df.tail()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID
102,193,Britney,Everett,BEVERETT,650.501.2876,2005-03-03,SH_CLERK,3900.0,NaN,123.0,50.0
103,194,Samuel,McCain,SMCCAIN,650.501.3876,2006-07-01,SH_CLERK,3200.0,NaN,123.0,50.0
104,195,Vance,Jones,VJONES,650.501.4876,2007-03-17,SH_CLERK,2800.0,NaN,123.0,50.0
105,196,Alana,Walsh,AWALSH,650.507.9811,2006-04-24,SH_CLERK,3100.0,NaN,124.0,50.0
106,197,Kevin,Feeney,KFEENEY,650.507.9822,2006-05-23,SH_CLERK,3000.0,NaN,124.0,50.0

In [44]:
df.shape

(107, 11)

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     107 non-null    int64
 1   FIRST_NAME      107 non-null    object
 2   LAST_NAME       107 non-null    object
 3   EMAIL           107 non-null    object
 4   PHONE_NUMBER    107 non-null    object
 5   HIRE_DATE       107 non-null    object
 6   JOB_ID          107 non-null    object
 7   SALARY          107 non-null    float64
 8   COMMISSION_PCT  35 non-null     float64
 9   MANAGER_ID      106 non-null    float64
 10  DEPARTMENT_ID   106 non-null    float64
dtypes: float64(4), int64(1), object(6)
memory usage: 9.3+ KB

In [46]:
df.isnull().sum()

EMPLOYEE_ID        0
FIRST_NAME         0
LAST_NAME          0
EMAIL              0
PHONE_NUMBER       0
HIRE_DATE          0
JOB_ID             0
SALARY             0
COMMISSION_PCT    72
MANAGER_ID         1
DEPARTMENT_ID      1
dtype: int64

In [47]:
pd.isnull(df).sum()

EMPLOYEE_ID        0
FIRST_NAME         0
LAST_NAME          0
EMAIL              0
PHONE_NUMBER       0
HIRE_DATE          0
JOB_ID             0
SALARY             0
COMMISSION_PCT    72
MANAGER_ID         1
DEPARTMENT_ID      1
dtype: int64

In [52]:
df['JOB_ID'].unique()

array(['SH_CLERK', 'AD_ASST', 'MK_MAN', 'MK_REP', 'HR_REP', 'PR_REP',
       'AC_MGR', 'AC_ACCOUNT', 'AD_PRES', 'AD_VP', 'IT_PROG', 'FI_MGR',
       'FI_ACCOUNT', 'PU_MAN', 'PU_CLERK', 'ST_MAN', 'ST_CLERK', 'SA_MAN',
       'SA_REP'], dtype=object)

In [53]:
df['JOB_ID'].nunique()

19

In [54]:
df['JOB_ID'].value_counts()

SA_REP        30
ST_CLERK      20
SH_CLERK      20
IT_PROG        5
FI_ACCOUNT     5
PU_CLERK       5
ST_MAN         5
SA_MAN         5
AD_VP          2
MK_REP         1
HR_REP         1
PR_REP         1
AC_MGR         1
AC_ACCOUNT     1
AD_PRES        1
AD_ASST        1
FI_MGR         1
PU_MAN         1
MK_MAN         1
Name: JOB_ID, dtype: int64

In [55]:
df.duplicated().sum() # no of duplicate record in dataset

0

In [60]:
df['FIRST_NAME']

0        Donald
1       Douglas
2      Jennifer
3       Michael
4           Pat
         ...
102     Britney
103      Samuel
104       Vance
105       Alana
106       Kevin
Name: FIRST_NAME, Length: 107, dtype: object

In [58]:
df[['FIRST_NAME','JOB_ID']]

    FIRST_NAME    JOB_ID
0       Donald  SH_CLERK
1      Douglas  SH_CLERK
2     Jennifer   AD_ASST
3      Michael    MK_MAN
4          Pat    MK_REP
..         ...       ...
102    Britney  SH_CLERK
103     Samuel  SH_CLERK
104      Vance  SH_CLERK
105      Alana  SH_CLERK
106      Kevin  SH_CLERK

[107 rows x 2 columns]

In [62]:
df['NAME']=df['FIRST_NAME']+' '+df['LAST_NAME']
df.head()

,EMPLOYEE_ID,FIRST_NAME,LAST_NAME,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,NAME
0,198,Donald,OConnell,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600.0,NaN,124.0,50.0,Donald OConnell
1,199,Douglas,Grant,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600.0,NaN,124.0,50.0,Douglas Grant
2,200,Jennifer,Whalen,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400.0,NaN,101.0,10.0,Jennifer Whalen
3,201,Michael,Hartstein,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000.0,NaN,100.0,20.0,Michael Hartstein
4,202,Pat,Fay,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0,Pat Fay

In [64]:
df.drop(columns=['FIRST_NAME','LAST_NAME'],inplace=True)

In [65]:
df

,EMPLOYEE_ID,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,NAME
0,198,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600.0,NaN,124.0,50.0,Donald OConnell
1,199,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600.0,NaN,124.0,50.0,Douglas Grant
2,200,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400.0,NaN,101.0,10.0,Jennifer Whalen
3,201,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000.0,NaN,100.0,20.0,Michael Hartstein
4,202,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0,Pat Fay
...,...,...,...,...,...,...,...,...,...,...
102,193,BEVERETT,650.501.2876,2005-03-03,SH_CLERK,3900.0,NaN,123.0,50.0,Britney Everett
103,194,SMCCAIN,650.501.3876,2006-07-01,SH_CLERK,3200.0,NaN,123.0,50.0,Samuel McCain
104,195,VJONES,650.501.4876,2007-03-17,SH_CLERK,2800.0,NaN,123.0,50.0,Vance Jones
105,196,AWALSH,650.507.9811,2006-04-24,SH_CLERK,3100.0,NaN,124.0,50.0,Alana Walsh
106,197,KFEENEY,650.507.9822,2006-05-23,SH_CLERK,3000.0,NaN,124.0,50.0,Kevin Feeney

In [66]:
df['HIRE_DATE']=pd.to_datetime(df['HIRE_DATE'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     107 non-null    int64
 1   EMAIL           107 non-null    object
 2   PHONE_NUMBER    107 non-null    object
 3   HIRE_DATE       107 non-null    datetime64[ns]
 4   JOB_ID          107 non-null    object
 5   SALARY          107 non-null    float64
 6   COMMISSION_PCT  35 non-null     float64
 7   MANAGER_ID      106 non-null    float64
 8   DEPARTMENT_ID   106 non-null    float64
 9   NAME            107 non-null    object
dtypes: datetime64[ns](1), float64(4), int64(1), object(4)
memory usage: 8.5+ KB

In [67]:
df

,EMPLOYEE_ID,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,NAME
0,198,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600.0,NaN,124.0,50.0,Donald OConnell
1,199,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600.0,NaN,124.0,50.0,Douglas Grant
2,200,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400.0,NaN,101.0,10.0,Jennifer Whalen
3,201,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000.0,NaN,100.0,20.0,Michael Hartstein
4,202,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0,Pat Fay
...,...,...,...,...,...,...,...,...,...,...
102,193,BEVERETT,650.501.2876,2005-03-03,SH_CLERK,3900.0,NaN,123.0,50.0,Britney Everett
103,194,SMCCAIN,650.501.3876,2006-07-01,SH_CLERK,3200.0,NaN,123.0,50.0,Samuel McCain
104,195,VJONES,650.501.4876,2007-03-17,SH_CLERK,2800.0,NaN,123.0,50.0,Vance Jones
105,196,AWALSH,650.507.9811,2006-04-24,SH_CLERK,3100.0,NaN,124.0,50.0,Alana Walsh
106,197,KFEENEY,650.507.9822,2006-05-23,SH_CLERK,3000.0,NaN,124.0,50.0,Kevin Feeney

In [71]:
df['YEAR']=df['HIRE_DATE'].dt.year # month /year
df

,EMPLOYEE_ID,EMAIL,PHONE_NUMBER,HIRE_DATE,JOB_ID,SALARY,COMMISSION_PCT,MANAGER_ID,DEPARTMENT_ID,NAME,YEAR
0,198,DOCONNEL,650.507.9833,2007-06-21,SH_CLERK,2600.0,NaN,124.0,50.0,Donald OConnell,2007
1,199,DGRANT,650.507.9844,2008-01-13,SH_CLERK,2600.0,NaN,124.0,50.0,Douglas Grant,2008
2,200,JWHALEN,515.123.4444,2003-09-17,AD_ASST,4400.0,NaN,101.0,10.0,Jennifer Whalen,2003
3,201,MHARTSTE,515.123.5555,2004-02-17,MK_MAN,13000.0,NaN,100.0,20.0,Michael Hartstein,2004
4,202,PFAY,603.123.6666,2005-08-17,MK_REP,6000.0,NaN,201.0,20.0,Pat Fay,2005
...,...,...,...,...,...,...,...,...,...,...,...
102,193,BEVERETT,650.501.2876,2005-03-03,SH_CLERK,3900.0,NaN,123.0,50.0,Britney Everett,2005
103,194,SMCCAIN,650.501.3876,2006-07-01,SH_CLERK,3200.0,NaN,123.0,50.0,Samuel McCain,2006
104,195,VJONES,650.501.4876,2007-03-17,SH_CLERK,2800.0,NaN,123.0,50.0,Vance Jones,2007
105,196,AWALSH,650.507.9811,2006-04-24,SH_CLERK,3100.0,NaN,124.0,50.0,Alana Walsh,2006
106,197,KFEENEY,650.507.9822,2006-05-23,SH_CLERK,3000.0,NaN,124.0,50.0,Kevin Feeney,2006

In [73]:
#dropping missing  records
df.dropna(inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 34 entries, 54 to 88
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     34 non-null     int64
 1   EMAIL           34 non-null     object
 2   PHONE_NUMBER    34 non-null     object
 3   HIRE_DATE       34 non-null     datetime64[ns]
 4   JOB_ID          34 non-null     object
 5   SALARY          34 non-null     float64
 6   COMMISSION_PCT  34 non-null     float64
 7   MANAGER_ID      34 non-null     float64
 8   DEPARTMENT_ID   34 non-null     float64
 9   NAME            34 non-null     object
 10  YEAR            34 non-null     int64
dtypes: datetime64[ns](1), float64(4), int64(2), object(4)
memory usage: 3.2+ KB

In [74]:
df['DEPARTMENT_ID']=df['DEPARTMENT_ID'].astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 34 entries, 54 to 88
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   EMPLOYEE_ID     34 non-null     int64
 1   EMAIL           34 non-null     object
 2   PHONE_NUMBER    34 non-null     object
 3   HIRE_DATE       34 non-null     datetime64[ns]
 4   JOB_ID          34 non-null     object
 5   SALARY          34 non-null     float64
 6   COMMISSION_PCT  34 non-null     float64
 7   MANAGER_ID      34 non-null     float64
 8   DEPARTMENT_ID   34 non-null     int32
 9   NAME            34 non-null     object
 10  YEAR            34 non-null     int64
dtypes: datetime64[ns](1), float64(3), int32(1), int64(2), object(4)
memory usage: 3.1+ KB

In [86]:
## Merging DataFrames
df1=pd.DataFrame({'CustomerID':[1,2,3,4,5,6],'Product':['Television','Television','Television','Earphones','Earphones','Earphones']})
df2=pd.DataFrame({'CustomerID':[2,4,6],'State':['Texas','Texas','Seattle']})

In [87]:
df1

   CustomerID     Product
0           1  Television
1           2  Television
2           3  Television
3           4   Earphones
4           5   Earphones
5           6   Earphones

In [88]:
df2

   CustomerID    State
0           2    Texas
1           4    Texas
2           6  Seattle

In [89]:
pd.merge(df1,df2,on='CustomerID',how='outer') # by default inner Join

   CustomerID     Product    State
0           1  Television      NaN
1           2  Television    Texas
2           3  Television      NaN
3           4   Earphones    Texas
4           5   Earphones      NaN
5           6   Earphones  Seattle

In [90]:
pd.merge(df1,df2,on='CustomerID',how='left')

   CustomerID     Product    State
0           1  Television      NaN
1           2  Television    Texas
2           3  Television      NaN
3           4   Earphones    Texas
4           5   Earphones      NaN
5           6   Earphones  Seattle

In [91]:
pd.merge(df1,df2,on='CustomerID')

   CustomerID     Product    State
0           2  Television    Texas
1           4   Earphones    Texas
2           6   Earphones  Seattle